using System;

namespace Arrays
{
    class Program
    {
        static void Main(string[] args)
        {
            //דרך ראשונה ליצירת מערך - באמצעות ציון מספר התאים שיהיו לאותו מערך
            //ללא צורך לתת את ערכי התאים בשורת האיתחול
            int[] arr1 = new int[3];
            arr1[0] = 2;
            arr1[1] = 4;
            arr1[2] = 8;


            //דרך שניה ליצירת מערך - באמצעות ציון מספר התאים שיהיו לאותו מערך
            //והשמת ערכי התאים בשורת האיתחול
            int[] arr2 = new int[3] { 2, 4, 8 };



            //דרך שלישית ליצירת מערך - באמצעות השמת ערכי התאים בשורת האיתחול 
            //ללא צורך בציון מספר התאים שיהיו לאותו מערך
            //מספר התאים יקבע לפי מספר הערכים שניתנו באיתחול
            int[] arr3 = new int[] { 2, 4, 8 };


            Console.WriteLine("---------------arr1------------------");
            for (int i = 0; i < arr1.Length; i++)
            {
                Console.Write(arr1[i] + " ");
            }
        }
    }
}
